<a href="https://colab.research.google.com/github/Ivanbh214/Machine_learning_Course_CIFO/blob/main/D%C3%ADa_17(17-11-21)/ExemplesPandas2021.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np

import pandas as pd

In [ ]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

s

In [ ]:
dates = pd.date_range("20130101", periods=6)

dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

df

                   A         B         C         D
2013-01-01 -1.279705 -1.117393  1.073602 -1.513694
2013-01-02 -0.404634 -0.439109  2.742824  1.490566
2013-01-03 -0.288179  0.067029  0.807272  2.772649
2013-01-04 -0.156997  2.102923  0.562503  0.006407
2013-01-05 -0.549231  0.732034 -0.799679 -0.576795
2013-01-06  0.724843  0.869398 -2.171055 -0.844253

In [ ]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)


df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [ ]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [ ]:
df.head()

                   A         B         C         D
2013-01-01 -1.279705 -1.117393  1.073602 -1.513694
2013-01-02 -0.404634 -0.439109  2.742824  1.490566
2013-01-03 -0.288179  0.067029  0.807272  2.772649
2013-01-04 -0.156997  2.102923  0.562503  0.006407
2013-01-05 -0.549231  0.732034 -0.799679 -0.576795

In [ ]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.156997  2.102923  0.562503  0.006407
2013-01-05 -0.549231  0.732034 -0.799679 -0.576795
2013-01-06  0.724843  0.869398 -2.171055 -0.844253

In [ ]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [ ]:
df.to_numpy()

array([[-1.27970491, -1.11739314,  1.07360166, -1.51369363],
       [-0.40463412, -0.43910945,  2.74282396,  1.49056593],
       [-0.28817865,  0.06702892,  0.80727207,  2.77264908],
       [-0.15699651,  2.10292289,  0.56250263,  0.00640665],
       [-0.54923144,  0.7320341 , -0.79967885, -0.5767953 ],
       [ 0.72484342,  0.86939768, -2.17105509, -0.84425329]])

In [ ]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [ ]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.325650  0.369147  0.369244  0.222480
std    0.648048  1.126257  1.683967  1.609295
min   -1.279705 -1.117393 -2.171055 -1.513694
25%   -0.513082 -0.312575 -0.459133 -0.777389
50%   -0.346406  0.399532  0.684887 -0.285194
75%   -0.189792  0.835057  1.007019  1.119526
max    0.724843  2.102923  2.742824  2.772649

In [ ]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.279705   -0.404634   -0.288179   -0.156997   -0.549231    0.724843
B   -1.117393   -0.439109    0.067029    2.102923    0.732034    0.869398
C    1.073602    2.742824    0.807272    0.562503   -0.799679   -2.171055
D   -1.513694    1.490566    2.772649    0.006407   -0.576795   -0.844253

In [ ]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.513694  1.073602 -1.117393 -1.279705
2013-01-02  1.490566  2.742824 -0.439109 -0.404634
2013-01-03  2.772649  0.807272  0.067029 -0.288179
2013-01-04  0.006407  0.562503  2.102923 -0.156997
2013-01-05 -0.576795 -0.799679  0.732034 -0.549231
2013-01-06 -0.844253 -2.171055  0.869398  0.724843

In [ ]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01 -1.279705 -1.117393  1.073602 -1.513694
2013-01-02 -0.404634 -0.439109  2.742824  1.490566
2013-01-03 -0.288179  0.067029  0.807272  2.772649
2013-01-05 -0.549231  0.732034 -0.799679 -0.576795
2013-01-06  0.724843  0.869398 -2.171055 -0.844253
2013-01-04 -0.156997  2.102923  0.562503  0.006407

In [ ]:
df["A"]

2013-01-01   -1.279705
2013-01-02   -0.404634
2013-01-03   -0.288179
2013-01-04   -0.156997
2013-01-05   -0.549231
2013-01-06    0.724843
Freq: D, Name: A, dtype: float64

In [ ]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.279705 -1.117393  1.073602 -1.513694
2013-01-02 -0.404634 -0.439109  2.742824  1.490566
2013-01-03 -0.288179  0.067029  0.807272  2.772649

In [ ]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.404634 -0.439109  2.742824  1.490566
2013-01-03 -0.288179  0.067029  0.807272  2.772649
2013-01-04 -0.156997  2.102923  0.562503  0.006407

In [ ]:
df.loc[dates[0]]

A   -1.279705
B   -1.117393
C    1.073602
D   -1.513694
Name: 2013-01-01 00:00:00, dtype: float64

In [ ]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.279705 -1.117393
2013-01-02 -0.404634 -0.439109
2013-01-03 -0.288179  0.067029
2013-01-04 -0.156997  2.102923
2013-01-05 -0.549231  0.732034
2013-01-06  0.724843  0.869398

In [ ]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.404634 -0.439109
2013-01-03 -0.288179  0.067029
2013-01-04 -0.156997  2.102923

In [ ]:
df.loc["20130102", ["A", "B"]]

A   -0.404634
B   -0.439109
Name: 2013-01-02 00:00:00, dtype: float64

In [ ]:
df.loc[dates[0], "A"]

-1.2797049081035337

In [ ]:
df.at[dates[0], "A"]

-1.2797049081035337

In [ ]:
df.iloc[3]

A   -0.156997
B    2.102923
C    0.562503
D    0.006407
Name: 2013-01-04 00:00:00, dtype: float64

In [ ]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.156997  2.102923
2013-01-05 -0.549231  0.732034

In [ ]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.404634  2.742824
2013-01-03 -0.288179  0.807272
2013-01-05 -0.549231 -0.799679

In [ ]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.404634 -0.439109  2.742824  1.490566
2013-01-03 -0.288179  0.067029  0.807272  2.772649

In [ ]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.117393  1.073602
2013-01-02 -0.439109  2.742824
2013-01-03  0.067029  0.807272
2013-01-04  2.102923  0.562503
2013-01-05  0.732034 -0.799679
2013-01-06  0.869398 -2.171055

In [ ]:
df.iloc[1, 1]

-0.43910945172061644

In [ ]:
df.iat[1, 1]

-0.43910945172061644

In [ ]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-06  0.724843  0.869398 -2.171055 -0.844253

In [ ]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  1.073602       NaN
2013-01-02       NaN       NaN  2.742824  1.490566
2013-01-03       NaN  0.067029  0.807272  2.772649
2013-01-04       NaN  2.102923  0.562503  0.006407
2013-01-05       NaN  0.732034       NaN       NaN
2013-01-06  0.724843  0.869398       NaN       NaN

In [ ]:
df2 = df.copy()

df2["E"] = ["one", "one", "two", "three", "four", "three"]

df2

                   A         B         C         D      E
2013-01-01 -1.279705 -1.117393  1.073602 -1.513694    one
2013-01-02 -0.404634 -0.439109  2.742824  1.490566    one
2013-01-03 -0.288179  0.067029  0.807272  2.772649    two
2013-01-04 -0.156997  2.102923  0.562503  0.006407  three
2013-01-05 -0.549231  0.732034 -0.799679 -0.576795   four
2013-01-06  0.724843  0.869398 -2.171055 -0.844253  three

In [ ]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -0.288179  0.067029  0.807272  2.772649   two
2013-01-05 -0.549231  0.732034 -0.799679 -0.576795  four